; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-4)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(free left)
(free right)
(at ball1 roomb)
(at ball2 roomb)
(at ball3 room4)
(at ball4 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 4
2. (pick ball2 roomb left)
   deleted: (at ball2 roomb) (free left)
   added: (carry ball2 left)
   goals met: 1 of 4
3. (pick ball1 roomb right)
   deleted: (at ball1 roomb) (free right)
   added: (carry ball1 right)
   goals met: 1 of 4
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 1 of 4
5. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 1 of 4
6. (drop ball2 room4 left)
   deleted: (carry ball2 left)
   added: (at ball2 room4) (free left)
   goals met: 2 of 4
7. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 2 of 4
8. (pick ball4 room5 left)
   deleted: (at ball4 room5) (free left)
   added: (carry ball4 left)
   goals met: 2 of 4
9. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 2 of 4
10. (drop ball4 room4 left)
   deleted: (carry ball4 left)
   added: (at ball4 room4) (free left)
   goals met: 3 of 4
11. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 3 of 4
12. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 4 of 4
